export const getEmailDataByCode = (code) => {
  const codeList = {
    surprise: {
      title: "Сюрприз моя хорошая 😊",
      content: `
        Дорогая моя Бягуля, если ты это читаешь значит моя программка работает и ты получила сюрприз письмо ❤😊
        Ну в таком случае думаю можно начать, правда опыта написания писем у меня нет и даже не знаю с чего мне начать 😅

        Может начать с самого начала раз уж пишу письмо, все таки времени довольно много 😊 

        Назад на полтора года, когда ты впервые мне написала, сказать честно я сильно удивился и возникло очень приятное чувство
        что я правда в нашем универе кому то был интересен настолько что даже специально для этого ты написала писмо чтобы узнать
        в порядке ли я. Я очень захотел тебе ответить. Да, хоть мы и не знали особо друг друга и провели меньше времени чем с остальными
        однокурсниками, но мне очень захотелось тебе ответить и сказать что со мной все хорошо, и я тебе ответил.
        `,
      code: "начало",
    },
    begining: {
      title: "Начало всего",
      content: `
        Можно сказать начиная с этого письма, я хотел получить от тебя ответ, поэтому после того как я тебе отвечал, 
        я несколько дней после проверял почту чтобы проверить не ответила ли ты мне, не знаю почему но мне хотелось открыть свою почту
        и увидеть новое письмо написанное от тебя.

        Так и пошло потом дальше, ты время от времени (хоть и раз в пол года) но писала с желанием узнать как я тут, нормально ли все со
        мной. Я был очень рад когда получал новое писмо и с большим энтузиазмом тебе отвечал, я как будто получал заряд позитива и энергии
        в моих относительно спокойных и размеренных буднях. В итоге мне стало как то мало что в эпоху технологий мы так редко по почте
        переписываемя и предложил может перейдем в Скайп 😄
        `,
      code: "уникальная",
    },
    unique: {
      title: "Уникальная девушка",
      content: `
        Как ты видишь сейчас, то что я решил предложить перейти в скайп стало очень переломным моментом, ведь начиная с этого мы начали
        больше и теснее общяться, как друг и подруга. Кто же знал что наши отношения смогут перерости в нечто большее, уж точно не я с моим
        взглядом на это 😅😅

        И в итоге мы начали с тобой много общаться, реально много по моим собственным меркам. Поначалу для меня все это было в новинку, ведь
        я ни с кем не общался так раньше, и часто мог тебя как то обидеть своими действиями и незнанием, но я правда старался стать для тебя
        лучше как друг, ведь я начал узнавать тебя с разных сторон, узнавать какая ты интересная и сильная личность, узнавать твои взгляды
        на многое что есть в мире, узнавать что ты мудра не по годам. Таких личностей как ты не встретишь каждый день, если вообще встретишь
        хоть раз за жизнь и мне очень хотелось чтобы ты была моей подругой.
        `,
      code: "больше",
    },
    more: {
      title: "Как говориться, дальше больше моя любимая 😘",
      content: `
        Я к тебе очень сильно привязался, и самое смешное что я это не осознавал до самого конца пока не получил пинок под зад и ты не сказала
        давай либо будем друзьями и держать черту или уже сделай что нибудь. Ну, мне долго думать не надо было, я не хотел переставать относиться
        к тебе не так как раньше и держать черту, так что предложил тебе начать встречаться, хоть и онлайн, но я очень хотел сохранить наши отношения
        и продолжать их развивать.

        Так мы и начали общаться, уже не как просто друзья, а как настоящая парочка, парень и девушка. Я начал тебе открываться еще больше чем раньше
        и ты начала мне открываться все больше и больше. Да, за время наших отношений у нас возникали и ссоры, и обиды и разногласия (в основном из-за твоего дурачка)
        но и приятных и счастливых моментов у нас было много. Ты во многом обо мне начала заботиться и переживать. И я, никогда не думавший что буду о ком-то так сильно
        переживать, начал проявлять невиданные мне раньше новые эмоции. Наши отношения как будто начали проходить через новый этап, через шторм самого разного, 
        и прятного и не очень.
        `,
      code: "рассвет",
    },
    dawn: {
      title: "После ночи всегда наступает рассвет моя хорошая 😊",
      content: `
        Мы через многое прошли вместе, и через многое нам еще предстоит пройти. Кто-то может сказать что наши отношения развиваются быстро и так не должно быть,
        но кто они такие чтобы говорить как должно а как не должно, не думаешь моя дорогая 😉? Сто дней, 100 дней, 100 days. Это было введение в нашу с тобой историю
        длиной в столь большой срок. Он был очень, ну очень богат на самые разные события, взлеты и падения, но мы вместе помогали друг другу, поддерживали друг друга,
        заботились друг о друге, вместе радовались и грустили, смеялись и плакали, но предисловие нашей с тобой книги мы осилили.

        Поэтому, Бягуля, моя Бягуля, моя новая семья, моя будущая жена, мама наших будущих детей, моя единственная, моя неповторимая, моя ненаглядная, моя сильная, 
        моя независимая, моя упрямая, моя целеустремленная, моя умная, моя боевая, моя прекрасная, моя чудесная, моя милая, моя дорогая, моя самая любимая и самая лучшая,
        моя... дойдем до эпилога нашей собственной истории, вместе?
        `,
      code: "Безумно люблю тебя Бягуль",
    },
  };

  const lowercaseCode = code.toLowerCase();
  let actualCode;
  switch (lowercaseCode) {
    case "сюрприз":
      actualCode = "surprise";
      break;
    case "начало":
      actualCode = "begining";
      break;
    case "уникальная":
      actualCode = "unique";
      break;
    case "больше":
      actualCode = "more";
      break;
    case "рассвет":
      actualCode = "dawn";
      break;
  }
  const emailData = codeList[actualCode];
  return emailData;
};
